var rule = {
	    title:'jsapi',
	    host:'https://www.baidu.com',
	    url:'/filter_movielist?fyfilter',
		detailUrl:'/play/fyid',
	    // searchUrl:'/search?query=**&page=fypage',
	    searchable:2,
	    quickSearch:0,
	    filterable:1,
		filter:{'all': [{'key': 'mcountry', 'name': '地区', 'value': [{'n': '全部地区', 'v': 'all'}, {'n': '中国大陆', 'v': '1'}, {'n': '中国台湾', 'v': '2'}, {'n': '中国香港', 'v': '3'}, {'n': '韩国', 'v': '4'}, {'n': '俄罗斯', 'v': '5'}, {'n': '美国', 'v': '6'}, {'n': '日本', 'v': '7'}, {'n': '印度', 'v': '8'}, {'n': '英国', 'v': '9'}, {'n': '德国', 'v': '10'}, {'n': '法国', 'v': '11'}, {'n': '意大利', 'v': '12'}, {'n': '泰国', 'v': '13'}, {'n': '爱沙尼亚', 'v': '14'}, {'n': '哈萨克斯坦', 'v': '15'}, {'n': '西班牙', 'v': '16'}, {'n': '黎巴嫩', 'v': '17'}, {'n': '巴西', 'v': '18'}, {'n': '澳大利亚', 'v': '19'}, {'n': '丹麦', 'v': '20'}, {'n': '瑞典', 'v': '21'}, {'n': '以色列', 'v': '22'}, {'n': '荷兰', 'v': '23'}, {'n': '伊朗', 'v': '24'}, {'n': '墨西哥', 'v': '25'}]}, {'key': 'mtag', 'name': '类型', 'value': [{'n': '全部类型', 'v': 'all'}, {'n': '剧情', 'v': '1'}, {'n': '动作', 'v': '2'}, {'n': '喜剧', 'v': '3'}, {'n': '爱情', 'v': '4'}, {'n': '科幻', 'v': '5'}, {'n': '悬疑', 'v': '6'}, {'n': '惊悚', 'v': '7'}, {'n': '恐怖', 'v': '8'}, {'n': '犯罪', 'v': '9'}, {'n': '音乐', 'v': '10'}, {'n': '冒险', 'v': '11'}, {'n': '历史', 'v': '12'}, {'n': '战争', 'v': '13'}, {'n': '奇幻', 'v': '14'}, {'n': '黑帮', 'v': '15'}, {'n': '文艺', 'v': '16'}, {'n': '传记', 'v': '17'}, {'n': '运动', 'v': '18'}, {'n': '同性', 'v': '19'}, {'n': '情色', 'v': '20'}]}, {'key': 'sort', 'name': '默认排序', 'value': [{'n': '默认排序', 'v': 'default'}, {'n': '评分排序', 'v': 'grade'}, {'n': '名称排序', 'v': 'name'}, {'n': '添加时间排序', 'v': 'createtime'}, {'n': '修改时间排序', 'v': 'updatetime'}]}, {'key': 'album', 'name': '专辑', 'value': [{'n': '全部专辑', 'v': 'all'}, {'n': '来吧，看动画', 'v': '55,56,57,58,84,116,118,119,120,164,549'}, {'n': '国漫之光', 'v': '7,9,10,33,81,209,210,793,794,795,796,988,1121,1122,1123'}, {'n': '魁拔', 'v': '7,9,10,33,740'}, {'n': '星游记', 'v': '81,82,83'}, {'n': '致郁', 'v': '34,35,66,256,341,353,480,1007'}, {'n': '丧甜', 'v': '238,239,505'}, {'n': '烧脑神剧', 'v': '354,355,409,410,411,809'}, {'n': '周杰伦', 'v': '851,871,901,921,1054'}, {'n': '新东方特技厨师汉尼拔', 'v': '136,137,138'}, {'n': '个人推荐', 'v': '2,7,9,10,21,33,40,54,81,139,175,256,279,281,409,410,411,705,793,794,795,796,809,976,981,1126,1228'}, {'n': '速度与激情系列', 'v': '904,905,906,907,908,909,910,911,912,913'}, {'n': '韩国暴力美学三部曲', 'v': '37,45,54'}, {'n': '汤姆·哈迪 Tom Hardy', 'v': '31,42,67,205,243,277,478,684,731,733,734,1007,1037,1046,1047,1167'}, {'n': '韩国人生三部曲', 'v': '112,114,115'}, {'n': '蝙蝠侠黑暗骑士三部曲', 'v': '275,276,277'}, {'n': '变形金刚系列', 'v': '874,875,876,877,878'}, {'n': '生化危机系列', 'v': '887,888,889,890,891,892'}]}], '1': [{'key': 'mcountry', 'name': '地区', 'value': [{'n': '全部地区', 'v': 'all'}, {'n': '中国大陆', 'v': '1'}, {'n': '中国台湾', 'v': '2'}, {'n': '中国香港', 'v': '3'}, {'n': '韩国', 'v': '4'}, {'n': '俄罗斯', 'v': '5'}, {'n': '美国', 'v': '6'}, {'n': '日本', 'v': '7'}, {'n': '印度', 'v': '8'}, {'n': '英国', 'v': '9'}, {'n': '德国', 'v': '10'}, {'n': '法国', 'v': '11'}, {'n': '意大利', 'v': '12'}, {'n': '泰国', 'v': '13'}, {'n': '爱沙尼亚', 'v': '14'}, {'n': '哈萨克斯坦', 'v': '15'}, {'n': '西班牙', 'v': '16'}, {'n': '黎巴嫩', 'v': '17'}, {'n': '巴西', 'v': '18'}, {'n': '澳大利亚', 'v': '19'}, {'n': '丹麦', 'v': '20'}, {'n': '瑞典', 'v': '21'}, {'n': '以色列', 'v': '22'}, {'n': '荷兰', 'v': '23'}, {'n': '伊朗', 'v': '24'}, {'n': '墨西哥', 'v': '25'}]}, {'key': 'mtag', 'name': '类型', 'value': [{'n': '全部类型', 'v': 'all'}, {'n': '剧情', 'v': '1'}, {'n': '动作', 'v': '2'}, {'n': '喜剧', 'v': '3'}, {'n': '爱情', 'v': '4'}, {'n': '科幻', 'v': '5'}, {'n': '悬疑', 'v': '6'}, {'n': '惊悚', 'v': '7'}, {'n': '恐怖', 'v': '8'}, {'n': '犯罪', 'v': '9'}, {'n': '音乐', 'v': '10'}, {'n': '冒险', 'v': '11'}, {'n': '历史', 'v': '12'}, {'n': '战争', 'v': '13'}, {'n': '奇幻', 'v': '14'}, {'n': '黑帮', 'v': '15'}, {'n': '文艺', 'v': '16'}, {'n': '传记', 'v': '17'}, {'n': '运动', 'v': '18'}, {'n': '同性', 'v': '19'}, {'n': '情色', 'v': '20'}]}, {'key': 'sort', 'name': '默认排序', 'value': [{'n': '默认排序', 'v': 'default'}, {'n': '评分排序', 'v': 'grade'}, {'n': '名称排序', 'v': 'name'}, {'n': '添加时间排序', 'v': 'createtime'}, {'n': '修改时间排序', 'v': 'updatetime'}]}, {'key': 'album', 'name': '专辑', 'value': [{'n': '全部专辑', 'v': 'all'}, {'n': '来吧，看动画', 'v': '55,56,57,58,84,116,118,119,120,164,549'}, {'n': '国漫之光', 'v': '7,9,10,33,81,209,210,793,794,795,796,988,1121,1122,1123'}, {'n': '魁拔', 'v': '7,9,10,33,740'}, {'n': '星游记', 'v': '81,82,83'}, {'n': '致郁', 'v': '34,35,66,256,341,353,480,1007'}, {'n': '丧甜', 'v': '238,239,505'}, {'n': '烧脑神剧', 'v': '354,355,409,410,411,809'}, {'n': '周杰伦', 'v': '851,871,901,921,1054'}, {'n': '新东方特技厨师汉尼拔', 'v': '136,137,138'}, {'n': '个人推荐', 'v': '2,7,9,10,21,33,40,54,81,139,175,256,279,281,409,410,411,705,793,794,795,796,809,976,981,1126,1228'}, {'n': '速度与激情系列', 'v': '904,905,906,907,908,909,910,911,912,913'}, {'n': '韩国暴力美学三部曲', 'v': '37,45,54'}, {'n': '汤姆·哈迪 Tom Hardy', 'v': '31,42,67,205,243,277,478,684,731,733,734,1007,1037,1046,1047,1167'}, {'n': '韩国人生三部曲', 'v': '112,114,115'}, {'n': '蝙蝠侠黑暗骑士三部曲', 'v': '275,276,277'}, {'n': '变形金刚系列', 'v': '874,875,876,877,878'}, {'n': '生化危机系列', 'v': '887,888,889,890,891,892'}]}], '2': [{'key': 'mcountry', 'name': '地区', 'value': [{'n': '全部地区', 'v': 'all'}, {'n': '中国大陆', 'v': '1'}, {'n': '中国台湾', 'v': '2'}, {'n': '中国香港', 'v': '3'}, {'n': '韩国', 'v': '4'}, {'n': '俄罗斯', 'v': '5'}, {'n': '美国', 'v': '6'}, {'n': '日本', 'v': '7'}, {'n': '印度', 'v': '8'}, {'n': '英国', 'v': '9'}, {'n': '德国', 'v': '10'}, {'n': '法国', 'v': '11'}, {'n': '意大利', 'v': '12'}, {'n': '泰国', 'v': '13'}, {'n': '爱沙尼亚', 'v': '14'}, {'n': '哈萨克斯坦', 'v': '15'}, {'n': '西班牙', 'v': '16'}, {'n': '黎巴嫩', 'v': '17'}, {'n': '巴西', 'v': '18'}, {'n': '澳大利亚', 'v': '19'}, {'n': '丹麦', 'v': '20'}, {'n': '瑞典', 'v': '21'}, {'n': '以色列', 'v': '22'}, {'n': '荷兰', 'v': '23'}, {'n': '伊朗', 'v': '24'}, {'n': '墨西哥', 'v': '25'}]}, {'key': 'mtag', 'name': '类型', 'value': [{'n': '全部类型', 'v': 'all'}, {'n': '剧情', 'v': '1'}, {'n': '动作', 'v': '2'}, {'n': '喜剧', 'v': '3'}, {'n': '爱情', 'v': '4'}, {'n': '科幻', 'v': '5'}, {'n': '悬疑', 'v': '6'}, {'n': '惊悚', 'v': '7'}, {'n': '恐怖', 'v': '8'}, {'n': '犯罪', 'v': '9'}, {'n': '音乐', 'v': '10'}, {'n': '冒险', 'v': '11'}, {'n': '历史', 'v': '12'}, {'n': '战争', 'v': '13'}, {'n': '奇幻', 'v': '14'}, {'n': '黑帮', 'v': '15'}, {'n': '文艺', 'v': '16'}, {'n': '传记', 'v': '17'}, {'n': '运动', 'v': '18'}, {'n': '同性', 'v': '19'}, {'n': '情色', 'v': '20'}]}, {'key': 'sort', 'name': '默认排序', 'value': [{'n': '默认排序', 'v': 'default'}, {'n': '评分排序', 'v': 'grade'}, {'n': '名称排序', 'v': 'name'}, {'n': '添加时间排序', 'v': 'createtime'}, {'n': '修改时间排序', 'v': 'updatetime'}]}, {'key': 'album', 'name': '专辑', 'value': [{'n': '全部专辑', 'v': 'all'}, {'n': '来吧，看动画', 'v': '55,56,57,58,84,116,118,119,120,164,549'}, {'n': '国漫之光', 'v': '7,9,10,33,81,209,210,793,794,795,796,988,1121,1122,1123'}, {'n': '魁拔', 'v': '7,9,10,33,740'}, {'n': '星游记', 'v': '81,82,83'}, {'n': '致郁', 'v': '34,35,66,256,341,353,480,1007'}, {'n': '丧甜', 'v': '238,239,505'}, {'n': '烧脑神剧', 'v': '354,355,409,410,411,809'}, {'n': '周杰伦', 'v': '851,871,901,921,1054'}, {'n': '新东方特技厨师汉尼拔', 'v': '136,137,138'}, {'n': '个人推荐', 'v': '2,7,9,10,21,33,40,54,81,139,175,256,279,281,409,410,411,705,793,794,795,796,809,976,981,1126,1228'}, {'n': '速度与激情系列', 'v': '904,905,906,907,908,909,910,911,912,913'}, {'n': '韩国暴力美学三部曲', 'v': '37,45,54'}, {'n': '汤姆·哈迪 Tom Hardy', 'v': '31,42,67,205,243,277,478,684,731,733,734,1007,1037,1046,1047,1167'}, {'n': '韩国人生三部曲', 'v': '112,114,115'}, {'n': '蝙蝠侠黑暗骑士三部曲', 'v': '275,276,277'}, {'n': '变形金刚系列', 'v': '874,875,876,877,878'}, {'n': '生化危机系列', 'v': '887,888,889,890,891,892'}]}], 'bangumi': [{'key': 'mcountry', 'name': '地区', 'value': [{'n': '全部地区', 'v': 'all'}, {'n': '中国大陆', 'v': '1'}, {'n': '中国台湾', 'v': '2'}, {'n': '中国香港', 'v': '3'}, {'n': '韩国', 'v': '4'}, {'n': '俄罗斯', 'v': '5'}, {'n': '美国', 'v': '6'}, {'n': '日本', 'v': '7'}, {'n': '印度', 'v': '8'}, {'n': '英国', 'v': '9'}, {'n': '德国', 'v': '10'}, {'n': '法国', 'v': '11'}, {'n': '意大利', 'v': '12'}, {'n': '泰国', 'v': '13'}, {'n': '爱沙尼亚', 'v': '14'}, {'n': '哈萨克斯坦', 'v': '15'}, {'n': '西班牙', 'v': '16'}, {'n': '黎巴嫩', 'v': '17'}, {'n': '巴西', 'v': '18'}, {'n': '澳大利亚', 'v': '19'}, {'n': '丹麦', 'v': '20'}, {'n': '瑞典', 'v': '21'}, {'n': '以色列', 'v': '22'}, {'n': '荷兰', 'v': '23'}, {'n': '伊朗', 'v': '24'}, {'n': '墨西哥', 'v': '25'}]}, {'key': 'mtag', 'name': '类型', 'value': [{'n': '全部类型', 'v': 'all'}, {'n': '剧情', 'v': '1'}, {'n': '动作', 'v': '2'}, {'n': '喜剧', 'v': '3'}, {'n': '爱情', 'v': '4'}, {'n': '科幻', 'v': '5'}, {'n': '悬疑', 'v': '6'}, {'n': '惊悚', 'v': '7'}, {'n': '恐怖', 'v': '8'}, {'n': '犯罪', 'v': '9'}, {'n': '音乐', 'v': '10'}, {'n': '冒险', 'v': '11'}, {'n': '历史', 'v': '12'}, {'n': '战争', 'v': '13'}, {'n': '奇幻', 'v': '14'}, {'n': '黑帮', 'v': '15'}, {'n': '文艺', 'v': '16'}, {'n': '传记', 'v': '17'}, {'n': '运动', 'v': '18'}, {'n': '同性', 'v': '19'}, {'n': '情色', 'v': '20'}]}, {'key': 'sort', 'name': '默认排序', 'value': [{'n': '默认排序', 'v': 'default'}, {'n': '评分排序', 'v': 'grade'}, {'n': '名称排序', 'v': 'name'}, {'n': '添加时间排序', 'v': 'createtime'}, {'n': '修改时间排序', 'v': 'updatetime'}]}, {'key': 'album', 'name': '专辑', 'value': [{'n': '全部专辑', 'v': 'all'}, {'n': '来吧，看动画', 'v': '55,56,57,58,84,116,118,119,120,164,549'}, {'n': '国漫之光', 'v': '7,9,10,33,81,209,210,793,794,795,796,988,1121,1122,1123'}, {'n': '魁拔', 'v': '7,9,10,33,740'}, {'n': '星游记', 'v': '81,82,83'}, {'n': '致郁', 'v': '34,35,66,256,341,353,480,1007'}, {'n': '丧甜', 'v': '238,239,505'}, {'n': '烧脑神剧', 'v': '354,355,409,410,411,809'}, {'n': '周杰伦', 'v': '851,871,901,921,1054'}, {'n': '新东方特技厨师汉尼拔', 'v': '136,137,138'}, {'n': '个人推荐', 'v': '2,7,9,10,21,33,40,54,81,139,175,256,279,281,409,410,411,705,793,794,795,796,809,976,981,1126,1228'}, {'n': '速度与激情系列', 'v': '904,905,906,907,908,909,910,911,912,913'}, {'n': '韩国暴力美学三部曲', 'v': '37,45,54'}, {'n': '汤姆·哈迪 Tom Hardy', 'v': '31,42,67,205,243,277,478,684,731,733,734,1007,1037,1046,1047,1167'}, {'n': '韩国人生三部曲', 'v': '112,114,115'}, {'n': '蝙蝠侠黑暗骑士三部曲', 'v': '275,276,277'}, {'n': '变形金刚系列', 'v': '874,875,876,877,878'}, {'n': '生化危机系列', 'v': '887,888,889,890,891,892'}]}], 'chinese_cartoon': [{'key': 'mcountry', 'name': '地区', 'value': [{'n': '全部地区', 'v': 'all'}, {'n': '中国大陆', 'v': '1'}, {'n': '中国台湾', 'v': '2'}, {'n': '中国香港', 'v': '3'}, {'n': '韩国', 'v': '4'}, {'n': '俄罗斯', 'v': '5'}, {'n': '美国', 'v': '6'}, {'n': '日本', 'v': '7'}, {'n': '印度', 'v': '8'}, {'n': '英国', 'v': '9'}, {'n': '德国', 'v': '10'}, {'n': '法国', 'v': '11'}, {'n': '意大利', 'v': '12'}, {'n': '泰国', 'v': '13'}, {'n': '爱沙尼亚', 'v': '14'}, {'n': '哈萨克斯坦', 'v': '15'}, {'n': '西班牙', 'v': '16'}, {'n': '黎巴嫩', 'v': '17'}, {'n': '巴西', 'v': '18'}, {'n': '澳大利亚', 'v': '19'}, {'n': '丹麦', 'v': '20'}, {'n': '瑞典', 'v': '21'}, {'n': '以色列', 'v': '22'}, {'n': '荷兰', 'v': '23'}, {'n': '伊朗', 'v': '24'}, {'n': '墨西哥', 'v': '25'}]}, {'key': 'mtag', 'name': '类型', 'value': [{'n': '全部类型', 'v': 'all'}, {'n': '剧情', 'v': '1'}, {'n': '动作', 'v': '2'}, {'n': '喜剧', 'v': '3'}, {'n': '爱情', 'v': '4'}, {'n': '科幻', 'v': '5'}, {'n': '悬疑', 'v': '6'}, {'n': '惊悚', 'v': '7'}, {'n': '恐怖', 'v': '8'}, {'n': '犯罪', 'v': '9'}, {'n': '音乐', 'v': '10'}, {'n': '冒险', 'v': '11'}, {'n': '历史', 'v': '12'}, {'n': '战争', 'v': '13'}, {'n': '奇幻', 'v': '14'}, {'n': '黑帮', 'v': '15'}, {'n': '文艺', 'v': '16'}, {'n': '传记', 'v': '17'}, {'n': '运动', 'v': '18'}, {'n': '同性', 'v': '19'}, {'n': '情色', 'v': '20'}]}, {'key': 'sort', 'name': '默认排序', 'value': [{'n': '默认排序', 'v': 'default'}, {'n': '评分排序', 'v': 'grade'}, {'n': '名称排序', 'v': 'name'}, {'n': '添加时间排序', 'v': 'createtime'}, {'n': '修改时间排序', 'v': 'updatetime'}]}, {'key': 'album', 'name': '专辑', 'value': [{'n': '全部专辑', 'v': 'all'}, {'n': '来吧，看动画', 'v': '55,56,57,58,84,116,118,119,120,164,549'}, {'n': '国漫之光', 'v': '7,9,10,33,81,209,210,793,794,795,796,988,1121,1122,1123'}, {'n': '魁拔', 'v': '7,9,10,33,740'}, {'n': '星游记', 'v': '81,82,83'}, {'n': '致郁', 'v': '34,35,66,256,341,353,480,1007'}, {'n': '丧甜', 'v': '238,239,505'}, {'n': '烧脑神剧', 'v': '354,355,409,410,411,809'}, {'n': '周杰伦', 'v': '851,871,901,921,1054'}, {'n': '新东方特技厨师汉尼拔', 'v': '136,137,138'}, {'n': '个人推荐', 'v': '2,7,9,10,21,33,40,54,81,139,175,256,279,281,409,410,411,705,793,794,795,796,809,976,981,1126,1228'}, {'n': '速度与激情系列', 'v': '904,905,906,907,908,909,910,911,912,913'}, {'n': '韩国暴力美学三部曲', 'v': '37,45,54'}, {'n': '汤姆·哈迪 Tom Hardy', 'v': '31,42,67,205,243,277,478,684,731,733,734,1007,1037,1046,1047,1167'}, {'n': '韩国人生三部曲', 'v': '112,114,115'}, {'n': '蝙蝠侠黑暗骑士三部曲', 'v': '275,276,277'}, {'n': '变形金刚系列', 'v': '874,875,876,877,878'}, {'n': '生化危机系列', 'v': '887,888,889,890,891,892'}]}]},
	    filter_url:'mcountry={{fl.mcountry or "all"}}&tag_arr%5B%5D={{fl.mtag or "all"}}&page=fypage&sort={{fl.sort or "updatetime"}}&album={{fl.album or "all"}}&title=',
	    headers:{
			'User-Agent':'MOBILE_UA',
		},
	    timeout:6000,
	    class_name:'全部形式&电影&电视剧&番剧&国漫',
	    class_url:'all&1&2&bangumi&chinese_cartoon',
	    class_parse:'',
		play_parse:true,
	    lazy:'',
	    limit:6,
	    double:false,
	    推荐:'',
		一级:'',
		一级:`js:
	log(input);
/*
	log('Object.keys(jsapi)=======>');
	log(Object.keys(jsapi));
	let t1 = jsapi.test;
	log('typeof(jsapi.test)====>'+typeof(t1));
	let t2 = jsapi.test1;
	log('typeof(jsapi.test1)====>'+typeof(t2));
	log('typeof(jsapi.test.add)===>'+typeof(jsapi.test.add));
	log('typeof(jsapi.test1.add1)====>'+typeof(jsapi.test1.add1));
	
	log('typeof(jsapi.htmlParser)====>'+typeof(jsapi.htmlParser));
	log('typeof(jsapi.htmlParser.pdfa)====>'+typeof(jsapi.htmlParser.pdfa));
	log('typeof(jsapi.htmlParser.pdfh)====>'+typeof(jsapi.htmlParser.pdfh));
	let html = '<a href="http://www.baidu.com">123<a>';
	log('jsapi.htmlParser.pdfh("'+html+'","a&&Text")====>'+jsapi.htmlParser.pdfh(html,"a&&Text"));
	
	log('typeof(jsapi.add)====>'+typeof(jsapi.add));
	log('typeof(jsapi.add1)====>'+typeof(jsapi.add1));
	
	log('jsapi.test.add(1,2)='+jsapi.test.add(1,2));
	log('jsapi.test1.add1(1,2)='+jsapi.test1.add1(1,2));
	
	*/
	//log('jsapi.test1.add(1,2)='+jsapi.test1.add(1,2));
	//log('jsapi.add(1,2)='+jsapi.add(1,2));
	//log('jsapi.add1(1,2)='+jsapi.add1(1,2));
	
	
	let d=[];
	for(let i=0;i<20;i++){
	d.push({
        title:'测试',
        url:'index.html',
        img:'https://gitee.com/CherishRx/imagewarehouse/raw/master/image/13096725fe56ce9cf643a0e4cd0c159c.gif',
        desc:'jsapi',
    });
	}
	
	setResult(d);
		`,
	二级:`js:
	let api=getProxyUrl()+'&url=';
	VOD={
       vod_id:'no_use',
      vod_name:'测试二级',
      type_name:input,
      vod_pic:'https://gitee.com/CherishRx/imagewarehouse/raw/master/image/13096725fe56ce9cf643a0e4cd0c159c.gif',
      vod_content:'这是一个原始js的测试案例',
      vod_play_from:'代理线路1$$$不代理线路2',
      vod_play_url:'选集播放1$'+api+'http://1.mp4#选集播放2$'+api+'http://2.mp4$$$选集播放3$3.mp4#选集播放4$4.mp4',
    };
	`,
	proxy_rule:`
	log(input);
	function a(it){
	if(it.startsWith('#')){
	return it
	}else{
	return urljoin2(url,it)
	}
	}
	let url = 'https://vip.lz-cdn3.com/20230706/20072_5c97b65e/index.m3u8';
	let m3u8 = request(url);
	log('m3u8处理前:'+m3u8);
	m3u8 = m3u8.split('\\n').map(a).join('\\n');
	log('m3u8处理后:============:'+m3u8);
	url = m3u8.split('\\n').slice(-1)[0];
	m3u8 = request(url);
	
	m3u8 = m3u8.split('\\n').map(a).join('\\n');
	input = [200,'application/vnd.apple.mpegurl',m3u8]
	`,
}