var rule = {
    title: '劇迷ai',
    host: 'https://gimy.ai',
    url: '/cat/fyfilter',
    searchUrl: '/search/**----------fypage---.html',
    filterable: 1, //是否启用分类筛选,
    filter_url: '{{fl.cateId}}-{{fl.area}}-{{fl.by}}------fypage---{{fl.year}}.html',
    filter: {
            	 "1":[{"key":"cateId","name":"類型","value":[{"n":"全部","v":"1"},{"n":"動作片","v":"6"},{"n":"喜劇片","v":"7"},{"n":"愛情片","v":"8"},{"n":"科幻片","v":"9"},{"n":"恐怖片","v":"10"},{"n":"劇情片","v":"11"},{"n":"戰爭片","v":"12"},{"n":"動畫電影","v":"24"}]},
            		 {"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"美國","v":"美國"},{"n":"歐美","v":"歐美"},{"n":"大陸","v":"大陸"},{"n":"中國大陸","v":"中國大陸"},{"n":"內地","v":"內地"},{"n":"臺灣","v":"臺灣"},{"n":"香港","v":"香港"},{"n":"韓國","v":"韓國"},{"n":"日本","v":"日本"},{"n":"新加坡","v":"新加坡"},{"n":"泰國","v":"泰國"},{"n":"英國","v":"英國"},{"n":"德國","v":"德國"},{"n":"俄羅斯","v":"俄羅斯"},{"n":"印度","v":"印度"},{"n":"加拿大","v":"加拿大"},{"n":"義大利","v":"意大利"},{"n":"法國","v":"法國"},{"n":"其他","v":"其他"}]},
            		 {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"}]},
            	         {"key":"by","name":"排序","value":[{"n":"全部","v":""},{"n":"按更新排序","v":"time"},{"n":"週人氣排序","v":"hits_week"},{"n":"總人氣排序","v":"hits"}]}],
            	"2":[{"key":"cateId","name":"類型","value":[{"n":"全部","v":"2"},{"n":"陸劇","v":"13"},{"n":"台劇","v":"14"},{"n":"日劇","v":"15"},{"n":"美劇","v":"16"},{"n":"韓劇","v":"20"},{"n":"港劇","v":"21"},{"n":"紀錄片","v":"22"},{"n":"海外劇","v":"31"}]},
            		{"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"美國","v":"美國"},{"n":"歐美","v":"歐美"},{"n":"大陸","v":"大陸"},{"n":"中國大陸","v":"中國大陸"},{"n":"內地","v":"內地"},{"n":"臺灣","v":"臺灣"},{"n":"香港","v":"香港"},{"n":"韓國","v":"韓國"},{"n":"日本","v":"日本"},{"n":"新加坡","v":"新加坡"},{"n":"泰國","v":"泰國"},{"n":"英國","v":"英國"},{"n":"德國","v":"德國"},{"n":"俄羅斯","v":"俄羅斯"},{"n":"印度","v":"印度"},{"n":"加拿大","v":"加拿大"},{"n":"義大利","v":"意大利"},{"n":"法國","v":"法國"},{"n":"其他","v":"其他"}]},
            	        {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"}]},
            	        {"key":"by","name":"排序","value":[{"n":"全部","v":""},{"n":"按更新排序","v":"time"},{"n":"週人氣排序","v":"hits_week"},{"n":"總人氣排序","v":"hits"}]}],
            	"29":[{"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"大陸","v":"大陸"},{"n":"中國","v":"中國"},{"n":"中國大陸","v":"中國大陸"},{"n":"韓國","v":"韓國"},{"n":"臺灣","v":"臺灣"},{"n":"美國","v":"美國"},{"n":"歐美","v":"歐美"},{"n":"日本","v":"日本"},{"n":"香港","v":"香港"}]},
            		  {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]},
            	          {"key":"by","name":"排序","value":[{"n":"全部","v":""},{"n":"按更新排序","v":"time"},{"n":"週人氣排序","v":"hits_week"},{"n":"總人氣排序","v":"hits"}]}],
            	"30":[{"key":"area","name":"地區","value":[{"n":"全部","v":""},{"n":"大陸","v":"大陸"},{"n":"中國","v":"中國"},{"n":"中國大陸","v":"中國大陸"},{"n":"韓國","v":"韓國"},{"n":"臺灣","v":"臺灣"},{"n":"美國","v":"美國"},{"n":"歐美","v":"歐美"},{"n":"日本","v":"日本"},{"n":"香港","v":"香港"}]},
            		  {"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]},
            	          {"key":"by","name":"排序","value":[{"n":"全部","v":""},{"n":"按更新排序","v":"time"},{"n":"週人氣排序","v":"hits_week"},{"n":"總人氣排序","v":"hits"}]}]
            		},
    filter_def: {1:{cateId: '1'},2:{cateId: '2'},29: {cateId: '29'},30: {cateId: '30'}},
    headers: { //网站的请求头,完整支持所有的,常带ua和cookies
        'User-Agent': 'MOBILE_UA',
        // "Cookie": "searchneed=ok"
    },
    class_name: '電影&電視劇&綜藝&動漫',
    class_url: '1&2&29&30',
    //class_parse: '.navbar-left&&li;a&&Text;a&&href;/(\\d+).html',
    play_parse: true,
	lazy:`js:
		var html = JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);
		var url = html.url;
		if (html.encrypt == '1') {
			url = unescape(url)
		} else if (html.encrypt == '2') {
			url = unescape(base64Decode(url))
		}
		let play_Url = 'json:http://127.0.0.1:10079/parse/?thread=0&proxy=&url=';
		if (/\\.m3u8|\\.mp4/.test(url)) {
			input = {
				jx: 0,
				url: url,
				playUrl: play_Url,
				parse: 1
			}
		} else if (/\\/share/.test(url)) {
			url = getHome(url) + request(url).match(/main.*?"(.*?)"/)[1];
			input = {
				jx: 0,
				url: url,
				parse: 0
			}
		} else {
			input
		}
	`,
    limit: 6,
    推荐: 'li.col-xs-4;li;a&&title;a.video-pic&&data-original;.text-bg-r&&Text;a&&href',
    double: true, // 推荐内容是否双层定位
    一级: '#content&&li;a&&title;a.video-pic&&data-original;.text-bg-r&&Text;a&&href',
    二级: {
        "title": "h1&&Text;li.col-xs-6 a&&Text",
        "img": "meta.img&&content",
        "desc": "li.col-sm-6:eq(0)&&Text;li.col-sm-6:eq(7)--span&&Text;li.col-sm-6:eq(3)--span&&Text;li.col-md-12--span:eq(1)&&Text;li.col-md-6--span:eq(2)&&Text",
        "content": ".details-content-all&&Text",
        "tabs": "div.gico",
        "lists": "ul.fade:eq(#id) li"
    },
    搜索: '#content&&div.details-info-min;*;*;.hidden-lg&&Text;*',
}